// 数据集合----动态修改数据
(function(){
    miData = {
        //starGoods明星单品数据
        starGoods:{
            imgSrc:['image/stargoods/1.png','image/stargoods/2.png','image/stargoods/3.png','image/stargoods/4.jpg','image/stargoods/5.png','image/stargoods/6.jpg','image/stargoods/7.jpg','image/stargoods/8.png','image/stargoods/9.jpg','image/stargoods/10.jpg'],
            title : ['B2C智能5 尊享版' , 'B2CMax 高配版' , '热销智能3S', 'B2C平板2 16GB现货' , 'B2C电视3S 48英寸','B2C智能4c','B2C盒子3 增强版' ,'B2C手环 2' ,'小蚁智能摄像机 夜视版' ,'米家压力IH电饭煲'],
            detail : ['4GB内存+128GB闪存，陶瓷版' , '6.44英寸大屏，3GB内存+64GB容量' , '金属机身，指纹识别，超长待机' , '轻薄全金属，海量内容' , '原装液晶屏，金属机身，足量现货','快、轻薄、美，青春五色可选' , '高端 4K 网络机顶盒','每天早10点开售','能看能听能说，智能远程控制','用聪明的锅，做幸福的饭'],
            price : ['2699元' , '1699元' ,'699元起' ,'999元','1999元','1099元','399元','149元','149元','999元']
        },
        // match搭配数据
        match:{
            hot:{
                title:["  B2C活塞耳机 基础版  ","  B2C移动电源100mAh  ","  B2C圈铁耳机  ","  B2C移动电源10000mAh 高配版  ","  B2C插线板  ","  B2C蓝牙耳机  ","  B2C蓝牙音箱  ","B2C小钢炮蓝牙音箱22 青春版 象牙白"],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:["5.9万人评价","8万人评价","6.9万人评价","5.3万人评价","4.2万人评价","8万人评价","15万人评价"]
            },
            ear:{
                title:["  B2C活塞耳机 基础版  ","  B2C移动电源15500mAh  ","  B2C圈铁耳机  ","  B2C移动电源10000mAh 高配版  ","  B2C插线板  ","  B2C蓝牙耳机  ","  B2C蓝牙音箱  ","B2C小钢炮蓝牙音箱99 青春版 象牙白"],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:["5.5万人评价","7.1万人评价","5.5万人评价","6.9万人评价","5万人评价","73万人评价","15万人评价"]
            },
            power:{
                title:["  B2C活塞耳机 基础版  ","  B2C移动电源1575mAh  ","  B2C圈铁耳机  ","  B2C移动电源10000mAh 高配版  ","  B2C插线板  ","  B2C蓝牙耳机  ","  B2C蓝牙音箱  ","B2C小钢炮蓝牙音箱66 青春版 象牙白"],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:["5.9万人评价","5.1万人评价","7.1万人评价","3.9万人评价","6万人评价","43万人评价","15万人评价"]
            },
            card:{
                title:["  B2C活塞耳机 基础版  ","  B2C移动电源1010mAh  ","  B2C圈铁耳机  ","  B2C移动电源10000mAh 高配版  ","  B2C插线板  ","  B2C蓝牙耳机  ","  B2C蓝牙音箱  ","B2C小钢炮蓝牙ff11 青春版 象牙白"],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:["9.1万人评价","5.8万人评价","5.1万人评价","1.9万人评价","1万人评价","53万人评价","15万人评价"]
            },
            length:4,
            attr:["hot","ear","power","card"]
        }
    }
})();